; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	spectrograph1 - mode
	infrared0 - mode
	infrared2 - mode
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation0 - direction
	Star4 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star4)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star6)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument6 infrared0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star4)
	(supports instrument7 infrared0)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star6)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet12)
)
(:goal (and
	(pointing satellite1 Star10)
	(pointing satellite3 Star3)
	(pointing satellite4 Star2)
	(have_image Planet7 spectrograph1)
	(have_image Phenomenon8 infrared2)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Star11 infrared0)
	(have_image Planet12 spectrograph1)
	(have_image Planet13 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 10
2. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 10
3. (turn_to satellite1 planet7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet7)
   goals met: 0 of 10
4. (take_image satellite1 planet7 instrument1 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 1 of 10
5. (turn_to satellite1 planet13 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet13)
   goals met: 1 of 10
6. (take_image satellite1 planet13 instrument1 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 2 of 10
7. (turn_to satellite1 planet12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet12)
   goals met: 2 of 10
8. (take_image satellite1 planet12 instrument1 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 3 of 10
9. (turn_to satellite1 phenomenon8 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 10
10. (take_image satellite1 phenomenon8 instrument1 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 4 of 10
11. (turn_to satellite1 planet9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet9)
   goals met: 4 of 10
12. (take_image satellite1 planet9 instrument1 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 5 of 10
13. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 5 of 10
14. (take_image satellite1 star11 instrument1 infrared0)
   added: (have_image star11 infrared0)
   goals met: 6 of 10
15. (turn_to satellite1 star10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star10)
   goals met: 7 of 10
16. (take_image satellite1 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 8 of 10
17. (turn_to satellite3 star3 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 star3)
   goals met: 9 of 10
18. (turn_to satellite4 star2 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 star2)
   goals met: 10 of 10
